using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.Runtime.InteropServices;
using System.Threading;
using Sharlayan;
using Sharlayan.Models;

namespace Chromatics.FFXIVInterfaces
{
    public class Cooldowns
    {
        public enum BardSongs
        {
            None = 0,
            MagesBallad = 5,
            ArmysPaeon = 10,
            WanderersMinuet = 15
        }

        public enum CardTypes
        {
            None = 0,
            Balance = 1,
            Bole = 2,
            Arrow = 3,
            Spear = 4,
            Ewer = 5,
            Spire = 6
        }

        public enum RoyalRoadTypes
        {
            None = 0,
            Enhanced = 1,
            Extended = 2,
            Spread = 3
        }

        private static CooldownRawData _rawData;
        public static DateTime lastUpdated = DateTime.MinValue;
        private static readonly TimeSpan updateInterval = TimeSpan.FromSeconds(0.05);

        public static byte[] _rawResourceData;


        public static bool initialized;
        public static bool cooldownsInitialized;
        public static bool resourcesInitialized;
        public static bool initializedActor = false;
        private static List<Signature> sList;
        private static readonly object refreshLock = new object();

        private static IntPtr characterAddress = IntPtr.Zero;

        private static readonly object cacheLock = new object();


        /**/

                        if (Scanner.Instance.Locations.ContainsKey("COOLDOWNS"))
                        {
                            var address = Scanner.Instance.Locations["COOLDOWNS"];

                            //PluginController.debug(" " + address.ToString("X8"));
                            _rawData = MemoryHandler.Instance.GetStructure<CooldownRawData>(address.GetAddress());
                        }
                        //cachedAutoAttackCount = Sharlayan.MemoryHandler.Instance.GetInt16(Sharlayan.Scanner.Locations["AUTO_ATTACK_COUNT"].GetAddress().ToInt64());

                        if (Scanner.Instance.Locations.ContainsKey("CLASSRESOURCES"))
                        {
                            var address = Scanner.Instance.Locations["CLASSRESOURCES"];

                            //PluginController.debug(" " + address.ToString("X8"));
                            _rawResourceData = MemoryHandler.Instance.GetByteArray(address.GetAddress(), 20);
                        }


                        lastUpdated = DateTime.Now;
                    }
                }
                catch
                {
                    initialized = false;
                }
            }
        }

        public static void checkCache()
        {
            lock (cacheLock)
            {
                if (lastUpdated + updateInterval <= DateTime.Now)
                    refreshData();
                /*
                if (initializedActor)
                {
                    GetRecentAction();
                }
                */
            }
        }

        public static float getTimer(int i)
        {
            if (!initialized)
                return 0;

            checkCache();

            return Math.Max(BitConverter.ToUInt16(_rawResourceData, i) / 1000f - currentTimeshift, 0);
        }

        public static byte getRaw(int i)
        {
            if (!initialized)
                return 0;

            checkCache();

            return _rawResourceData[i];
        }

        public static void startGCDPredict()
        {
            predictGCDUntil = DateTime.Now + TimeSpan.FromSeconds(0.5);
            predictGCDDone = DateTime.Now + TimeSpan.FromSeconds(2.5);
        }

        public static void startCastPredict()
        {
            predictCastUntil = DateTime.Now + TimeSpan.FromSeconds(0.5);
            predictCastDone = DateTime.Now + TimeSpan.FromSeconds(2.5);
        }

        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        private struct ClassResourceRawData
        {
            // Dragoon: Blood of the dragon timer (1000 = 1 second)
            // Ninja: Huton timer
            // Bard: Song remaining time
            // Warrior: Wrath
            // MCH: Overheat timer (countdown from 10 seconds, 1000 = 1 second). Also the timer for when Gauss Barrel can be turned back on after overheat.
            // Monk: Greased Lightning timer
            // AST: Card timer
            [MarshalAs(UnmanagedType.I2)] [FieldOffset(0x6)] // B0
            public readonly short resource1;

            // Ninja: 0 most of the time. 1 briefly after casting huton
            // MCH: Heat Gauge (stays at 100 when overheated)
            // BLM: Combine resource2 and resource3 into an astral fire timer (ugly)
            // Monk: Greased Lightning Stacks
            // Bard: Song Repertoire stacks
            [MarshalAs(UnmanagedType.I1)] [FieldOffset(0x8)] // B2
            public readonly byte resource2;

            // Bard: 15 = Wanderer's Minuet, 10 = Army's Paeon, 5 = Mage's Ballad, Anything else = nothing. May be a bit mask.
            // MCH: Ammo count
            // BLM: Combine resource2 and resource3 into an astral fire timer (ugly)
            [MarshalAs(UnmanagedType.I1)] [FieldOffset(0x9)] // B3
            public readonly byte resource3;

            // MCH: Gauss barrel (bool)
            // BLM: 255 = Umbral Ice 1; 254 = Umbral Ice 2; 253 = Umbral Ice 3; 1 = Astral Fire 1; 2 = Astral Fire 2; 3 = Astral Fire 3. If converted to signed, umbral 1/2/3 would be -1/-2/-3 respectively.
            // SMN: Aetherflow stacks and Aethertrail stacks. Bitmask - low bits (1 and 2) represent aetherflow, bits 3 and 4 represent aethertrail stacks
            // SCH: Aetherflow stacks
            // AST: Split in half, low bits contain current card, high bits contain held card. (1 = Balance, 2 = Bole, 3 = Arrow, 4 = Spear, 5 = Ewer, 6 = Spire). 
            [MarshalAs(UnmanagedType.I1)] [FieldOffset(0x10)] // B4
            public readonly byte resource4;


            // BLM: Umbral Heart count
            // AST: Royal Road effect (16 = Enhanced, 32 = Extended, 48 = spread). Looks like it's the top 4 bits. Not sure if the lower 4 bits are used for anything yet.
            [MarshalAs(UnmanagedType.I1)] [FieldOffset(0x11)] // B5
            public readonly byte resource5;


            // BLM: Enochian active (bool)
            [MarshalAs(UnmanagedType.I1)] [FieldOffset(0x12)] // B6
            public readonly byte resource6;


            // Ninja: total number of times Huton has been used or refreshed
            [MarshalAs(UnmanagedType.I2)] [FieldOffset(0x13)] // B7
            public readonly short resource7;
        }

        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        private struct CooldownRawData
        {
            // 01CECC84
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x0)] // 
            public readonly float afterSkillLockTime;

            [MarshalAs(UnmanagedType.Bool)] [FieldOffset(0x20)] public readonly bool currentlyCasting;

            // 01CECCB0
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x28)] // 
            public readonly float castTimeElapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x2C)] // 
            public readonly float castTimeTotal;


            // 01CECCE0
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x58)] // 
            public readonly float comboTimeRemaining;


            // 01DF98A4
            // 01DF99A0
            [MarshalAs(UnmanagedType.U4)] [FieldOffset(0x118)] // 
            public readonly int actionCount;


            // 
            //  (99)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x13C)] public readonly float cooldownType99Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x140)] public readonly float cooldownType99Total;


            // 
            // Painflare (0)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x150)] public readonly float cooldownType0Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x154)] public readonly float cooldownType0Total;


            // 
            // EnergyDrain (1)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x164)] // 0x128
            public readonly float cooldownType1Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x168)] // 0x12C
            public readonly float cooldownType1Total;


            // 
            // Bane (2)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x178)] // 0x150
            public readonly float cooldownType2Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x17C)] // 0x154
            public readonly float cooldownType2Total;


            // 
            // Fester (3)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x18C)] // 0x18C
            public readonly float cooldownType3Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x190)] // 0x190
            public readonly float cooldownType3Total;


            // 
            // Tri-Disaster (4)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1A0)] // 0x204
            public readonly float cooldownType4Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1A4)] // 0x208
            public readonly float cooldownType4Total;


            // 
            // Aetherflow (5)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1B4)] // 0x114
            public readonly float cooldownType5Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1B8)] // 0x118
            public readonly float cooldownType5Total;


            // 
            // Virus (6)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1C8)] // 0x13C
            public readonly float cooldownType6Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1CC)] // 0x140
            public readonly float cooldownType6Total;


            // 
            // Rouse (7)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1DC)] // 0x178
            public readonly float cooldownType7Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1E0)] // 0x17C
            public readonly float cooldownType7Total;


            // 
            // Spur (8)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1F0)] // 0x1B4
            public readonly float cooldownType8Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x1F4)] // 0x1B8
            public readonly float cooldownType8Total;


            // 
            // Kassatsu (9)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x204)] // 0x1DC
            public readonly float cooldownType9Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x208)] // 0x1E0
            public readonly float cooldownType9Total;


            // 
            // Eye for an Eye (10)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x218)] // 0x164
            public readonly float cooldownType10Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x21C)] // 0x168
            public readonly float cooldownType10Total;


            // 
            // Bulwark (11)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x22C)] // 0x1A0
            public readonly float cooldownType11Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x230)] // 0x1A4
            public readonly float cooldownType11Total;


            // 02138AC8
            // Enkindle (12)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x240)] // 0x1C8
            public readonly float cooldownType12Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x244)] // 0x1CC
            public readonly float cooldownType12Total;


            // 
            // Hallowed Ground (13)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x254)] // 0x1F0
            public readonly float cooldownType13Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x258)] // 0x1F4
            public readonly float cooldownType13Total;


            // 02138AF0
            // Dreadwyrm Trance (14)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x268)] // 0x1F0
            public readonly float cooldownType14Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x26C)] // 0x1F4
            public readonly float cooldownType14Total;


            // 02138AF0
            // Deathflare (15)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x27C)] // 0x1F0
            public readonly float cooldownType15Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x280)] // 0x1F4
            public readonly float cooldownType15Total;


            // 02138AF0
            //  (16)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x290)] // 0x1F0
            public readonly float cooldownType16Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x294)] // 0x1F4
            public readonly float cooldownType16Total;


            // 02138AF0
            //  (17)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x2A4)] // 0x1F0
            public readonly float cooldownType17Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x2A8)] // 0x1F4
            public readonly float cooldownType17Total;


            // 02138AF0
            //  (18)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x2B8)] // 0x1F0
            public readonly float cooldownType18Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x2BC)] // 0x1F4
            public readonly float cooldownType18Total;


            //  (19)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x2CC)] // 0x1F0
            public readonly float cooldownType19Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x2D0)] // 0x1F4
            public readonly float cooldownType19Total;


            //  (20)
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x2E0)] // 0x1F0
            public readonly float cooldownType20Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x2E4)] // 0x1F4
            public readonly float cooldownType20Total;


            // 022FA638
            // 10FA638
            // 01CED0DC
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x470)] // 0x434
            public readonly float cooldownCrossClassSlot1Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x474)] // 0x438
            public readonly float cooldownCrossClassSlot1Total;


            // 01CED0F0
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x484)] // 0x448
            public readonly float cooldownCrossClassSlot2Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x488)] // 0x44C
            public readonly float cooldownCrossClassSlot2Total;


            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x498)] // 02140B30
            public readonly float cooldownCrossClassSlot3Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x49C)] // 02140B34
            public readonly float cooldownCrossClassSlot3Total;


            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x4AC)] // 02140B44
            public readonly float cooldownCrossClassSlot4Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x4B0)] // 02140B48
            public readonly float cooldownCrossClassSlot4Total;


            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x4C0)] // 02140B58
            public readonly float cooldownCrossClassSlot5Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x4C4)] // 02140B5C
            public readonly float cooldownCrossClassSlot5Total;


            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x4D4)] // 
            public readonly float cooldownCrossClassSlot6Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x4D8)] // 
            public readonly float cooldownCrossClassSlot6Total;


            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x4E8)] // 
            public readonly float cooldownCrossClassSlot7Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x4EC)] // 
            public readonly float cooldownCrossClassSlot7Total;


            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x4FC)] // 
            public readonly float cooldownCrossClassSlot8Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x500)] // 
            public readonly float cooldownCrossClassSlot8Total;


            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x510)] // 
            public readonly float cooldownCrossClassSlot9Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x514)] // 
            public readonly float cooldownCrossClassSlot9Total;


            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x524)] // 
            public readonly float cooldownCrossClassSlot10Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x528)] // 
            public readonly float cooldownCrossClassSlot10Total;


            // 01CED208
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x59C)] // 0x560
            public readonly float cooldownSprintElapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x5A0)] // 0x564
            public readonly float cooldownSprintTotal;


            // 01CED230
            [MarshalAs(UnmanagedType.Bool)] [FieldOffset(0x5BC)] // 0x588
            public readonly bool globalCooldownInUse;


            // 01CED230
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x5C4)] // 0x588
            public readonly float globalCooldownElapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x5C8)] // 0x58C
            public readonly float globalCooldownTotal;


            // 01CED244
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x5D8)] // 02140C70
            public readonly float cooldownPotionElapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x5DC)] // 02140C74
            public readonly float cooldownPotionTotal;


            // 01CED244
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x5EC)] // 02140C70
            public readonly float cooldownPoisonPotionElapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x5F0)] // 02140C74
            public readonly float cooldownPoisonPotionTotal;


            // 01CED3AC
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x740)] // 0x704
            public readonly float cooldownPetAbility1Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x744)] // 0x708
            public readonly float cooldownPetAbility1Total;


            // 01CED3C0
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x754)] // 0x718
            public readonly float cooldownPetAbility2Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x758)] // 0x71C
            public readonly float cooldownPetAbility2Total;


            // 01CED3D4
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x768)] // 0x72C
            public readonly float cooldownPetAbility3Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x76C)] // 0x730
            public readonly float cooldownPetAbility3Total;


            // 01CED3E8
            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x77C)] // 0x740
            public readonly float cooldownPetAbility4Elapsed;

            [MarshalAs(UnmanagedType.R4)] [FieldOffset(0x780)] // 0x744
            public readonly float cooldownPetAbility4Total;
        }

        public class Cooldown
        {
            private DateTime _started = DateTime.MinValue;
            private TimeSpan _totalTime = TimeSpan.Zero;

            public Cooldown(float totalTime)
            {
                _totalTime = TimeSpan.FromSeconds(totalTime);
            }

            public float timeElapsed => (float) (DateTime.Now - _started).TotalSeconds + currentTimeshift;

            public float timeTotal
            {
                get => (float) _totalTime.TotalSeconds;
                set => _totalTime = TimeSpan.FromSeconds(value);
            }

            public float timeRemaining => (float) Math.Max(
                (_started + _totalTime - DateTime.Now).TotalSeconds - currentTimeshift, 0);

            public void start(bool irrelivent = false)
            {
                _started = DateTime.Now;
            }
        }
    }
}