using System;
using System.Collections.Generic;

using System.Runtime.InteropServices;
using System.Threading;
using Sharlayan.Helpers;
using Sharlayan.Core.Enums;
using Sharlayan.Core;
using Sharlayan.Models;
using System.Diagnostics;

namespace Chromatics.FFXIVInterfaces
{
    public class Cooldowns
    {
        private static CooldownRawData _rawData;
        public static DateTime lastUpdated = DateTime.MinValue;
        private static TimeSpan updateInterval = TimeSpan.FromSeconds(0.05);

        public static Byte[] _rawResourceData;

        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        private struct ClassResourceRawData
        {
            // Dragoon: Blood of the dragon timer (1000 = 1 second)
            // Ninja: Huton timer
            // Bard: Song remaining time
            // Warrior: Wrath
            // MCH: Overheat timer (countdown from 10 seconds, 1000 = 1 second). Also the timer for when Gauss Barrel can be turned back on after overheat.
            // Monk: Greased Lightning timer
            // AST: Card timer
            [MarshalAs(UnmanagedType.I2)]
            [FieldOffset(0x6)] // B0
            public short resource1;

            // Ninja: 0 most of the time. 1 briefly after casting huton
            // MCH: Heat Gauge (stays at 100 when overheated)
            // BLM: Combine resource2 and resource3 into an astral fire timer (ugly)
            // Monk: Greased Lightning Stacks
            // Bard: Song Repertoire stacks
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(0x8)] // B2
            public byte resource2;

            // Bard: 15 = Wanderer's Minuet, 10 = Army's Paeon, 5 = Mage's Ballad, Anything else = nothing. May be a bit mask.
            // MCH: Ammo count
            // BLM: Combine resource2 and resource3 into an astral fire timer (ugly)
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(0x9)] // B3
            public byte resource3;

            // MCH: Gauss barrel (bool)
            // BLM: 255 = Umbral Ice 1; 254 = Umbral Ice 2; 253 = Umbral Ice 3; 1 = Astral Fire 1; 2 = Astral Fire 2; 3 = Astral Fire 3. If converted to signed, umbral 1/2/3 would be -1/-2/-3 respectively.
            // SMN: Aetherflow stacks and Aethertrail stacks. Bitmask - low bits (1 and 2) represent aetherflow, bits 3 and 4 represent aethertrail stacks
            // SCH: Aetherflow stacks
            // AST: Split in half, low bits contain current card, high bits contain held card. (1 = Balance, 2 = Bole, 3 = Arrow, 4 = Spear, 5 = Ewer, 6 = Spire). 
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(0x10)] // B4
            public byte resource4;


            // BLM: Umbral Heart count
            // AST: Royal Road effect (16 = Enhanced, 32 = Extended, 48 = spread). Looks like it's the top 4 bits. Not sure if the lower 4 bits are used for anything yet.
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(0x11)] // B5
            public byte resource5;


            // BLM: Enochian active (bool)
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(0x12)] // B6
            public byte resource6;


            // Ninja: total number of times Huton has been used or refreshed
            [MarshalAs(UnmanagedType.I2)]
            [FieldOffset(0x13)] // B7
            public short resource7;


        }

        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        private struct CooldownRawData
        {
            // 01CECC84
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x0)] // 
            public float afterSkillLockTime;

            [MarshalAs(UnmanagedType.Bool)]
            [FieldOffset(0x20)]
            public bool currentlyCasting;

            // 01CECCB0
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x28)] // 
            public float castTimeElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2C)] // 
            public float castTimeTotal;



            // 01CECCE0
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x58)] // 
            public float comboTimeRemaining;



            // 01DF98A4
            // 01DF99A0
            [MarshalAs(UnmanagedType.U4)]
            [FieldOffset(0x118)] // 
            public int actionCount;



            // 
            //  (99)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x13C)]
            public float cooldownType99Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x140)]
            public float cooldownType99Total;



            // 
            // Painflare (0)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x150)]
            public float cooldownType0Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x154)]
            public float cooldownType0Total;


            // 
            // EnergyDrain (1)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x164)] // 0x128
            public float cooldownType1Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x168)] // 0x12C
            public float cooldownType1Total;


            // 
            // Bane (2)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x178)] // 0x150
            public float cooldownType2Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x17C)] // 0x154
            public float cooldownType2Total;


            // 
            // Fester (3)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x18C)] // 0x18C
            public float cooldownType3Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x190)] // 0x190
            public float cooldownType3Total;



            // 
            // Tri-Disaster (4)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1A0)] // 0x204
            public float cooldownType4Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1A4)] // 0x208
            public float cooldownType4Total;




            // 
            // Aetherflow (5)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1B4)] // 0x114
            public float cooldownType5Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1B8)] // 0x118
            public float cooldownType5Total;




            // 
            // Virus (6)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1C8)] // 0x13C
            public float cooldownType6Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1CC)] // 0x140
            public float cooldownType6Total;


            // 
            // Rouse (7)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1DC)] // 0x178
            public float cooldownType7Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1E0)] // 0x17C
            public float cooldownType7Total;


            // 
            // Spur (8)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1F0)] // 0x1B4
            public float cooldownType8Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1F4)] // 0x1B8
            public float cooldownType8Total;



            // 
            // Kassatsu (9)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x204)] // 0x1DC
            public float cooldownType9Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x208)] // 0x1E0
            public float cooldownType9Total;




            // 
            // Eye for an Eye (10)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x218)] // 0x164
            public float cooldownType10Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x21C)] // 0x168
            public float cooldownType10Total;


            // 
            // Bulwark (11)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x22C)] // 0x1A0
            public float cooldownType11Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x230)] // 0x1A4
            public float cooldownType11Total;



            // 02138AC8
            // Enkindle (12)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x240)] // 0x1C8
            public float cooldownType12Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x244)] // 0x1CC
            public float cooldownType12Total;




            // 
            // Hallowed Ground (13)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x254)] // 0x1F0
            public float cooldownType13Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x258)] // 0x1F4
            public float cooldownType13Total;


            // 02138AF0
            // Dreadwyrm Trance (14)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x268)] // 0x1F0
            public float cooldownType14Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x26C)] // 0x1F4
            public float cooldownType14Total;



            // 02138AF0
            // Deathflare (15)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x27C)] // 0x1F0
            public float cooldownType15Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x280)] // 0x1F4
            public float cooldownType15Total;


            // 02138AF0
            //  (16)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x290)] // 0x1F0
            public float cooldownType16Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x294)] // 0x1F4
            public float cooldownType16Total;


            // 02138AF0
            //  (17)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2A4)] // 0x1F0
            public float cooldownType17Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2A8)] // 0x1F4
            public float cooldownType17Total;


            // 02138AF0
            //  (18)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2B8)] // 0x1F0
            public float cooldownType18Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2BC)] // 0x1F4
            public float cooldownType18Total;


            //  (19)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2CC)] // 0x1F0
            public float cooldownType19Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2D0)] // 0x1F4
            public float cooldownType19Total;


            //  (20)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2E0)] // 0x1F0
            public float cooldownType20Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2E4)] // 0x1F4
            public float cooldownType20Total;








            // 022FA638
            // 10FA638
            // 01CED0DC
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x470)] // 0x434
            public float cooldownCrossClassSlot1Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x474)] // 0x438
            public float cooldownCrossClassSlot1Total;


            // 01CED0F0
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x484)] // 0x448
            public float cooldownCrossClassSlot2Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x488)] // 0x44C
            public float cooldownCrossClassSlot2Total;




            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x498)] // 02140B30
            public float cooldownCrossClassSlot3Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x49C)] // 02140B34
            public float cooldownCrossClassSlot3Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4AC)] // 02140B44
            public float cooldownCrossClassSlot4Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4B0)] // 02140B48
            public float cooldownCrossClassSlot4Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4C0)] // 02140B58
            public float cooldownCrossClassSlot5Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4C4)] // 02140B5C
            public float cooldownCrossClassSlot5Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4D4)] // 
            public float cooldownCrossClassSlot6Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4D8)] // 
            public float cooldownCrossClassSlot6Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4E8)] // 
            public float cooldownCrossClassSlot7Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4EC)] // 
            public float cooldownCrossClassSlot7Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4FC)] // 
            public float cooldownCrossClassSlot8Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x500)] // 
            public float cooldownCrossClassSlot8Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x510)] // 
            public float cooldownCrossClassSlot9Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x514)] // 
            public float cooldownCrossClassSlot9Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x524)] // 
            public float cooldownCrossClassSlot10Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x528)] // 
            public float cooldownCrossClassSlot10Total;



            // 01CED208
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x59C)] // 0x560
            public float cooldownSprintElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x5A0)] // 0x564
            public float cooldownSprintTotal;



            // 01CED230
            [MarshalAs(UnmanagedType.Bool)]
            [FieldOffset(0x5BC)] // 0x588
            public bool globalCooldownInUse;



            // 01CED230
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x5C4)] // 0x588
            public float globalCooldownElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x5C8)] // 0x58C
            public float globalCooldownTotal;



            // 01CED244
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x5D8)] // 02140C70
            public float cooldownPotionElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x5DC)] // 02140C74
            public float cooldownPotionTotal;



            // 01CED244
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x5EC)] // 02140C70
            public float cooldownPoisonPotionElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x5F0)] // 02140C74
            public float cooldownPoisonPotionTotal;




            // 01CED3AC
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x740)] // 0x704
            public float cooldownPetAbility1Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x744)] // 0x708
            public float cooldownPetAbility1Total;


            // 01CED3C0
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x754)] // 0x718
            public float cooldownPetAbility2Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x758)] // 0x71C
            public float cooldownPetAbility2Total;


            // 01CED3D4
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x768)] // 0x72C
            public float cooldownPetAbility3Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x76C)] // 0x730
            public float cooldownPetAbility3Total;


            // 01CED3E8
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x77C)] // 0x740
            public float cooldownPetAbility4Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x780)] // 0x744
            public float cooldownPetAbility4Total;



        }


        public static bool initialized = false;
        public static bool cooldownsInitialized = false;
        public static bool resourcesInitialized = false;
        public static bool initializedActor = false;
        static List<Signature> sList;
        static object refreshLock = new object();

        private static IntPtr characterAddress = IntPtr.Zero;


        public static void refreshData()
        {
            lock (refreshLock)
            {
                try
                {

                    if (!initialized)
                    {
                        if (!Sharlayan.Scanner.Instance.Locations.ContainsKey("COOLDOWNS") || !cooldownsInitialized)
                        {
                            //PluginController.debug("Initializing cooldowns...");

                            sList = new List<Signature>();

                            // 021386E4
