using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.Runtime.InteropServices;
using System.Threading;
using Sharlayan;
using Sharlayan.Models;

namespace Chromatics.FFXIVInterfaces
{
    public class Cooldowns
    {
        public enum BardSongs
        {
            None = 0,
            MagesBallad = 5,
            ArmysPaeon = 10,
            WanderersMinuet = 15
        }

        public enum CardTypes
        {
            None = 0,
            Balance = 1,
            Bole = 2,
            Arrow = 3,
            Spear = 4,
            Ewer = 5,
            Spire = 6,
            Lady = 7,
            Lord = 8
        }

        public enum RoyalRoadTypes
        {
            None = 0,
            Enhanced = 1,
            Extended = 2,
            Spread = 3
        }

        private static CooldownRawData _rawData;
        public static DateTime LastUpdated = DateTime.MinValue;
        private static readonly TimeSpan UpdateInterval = TimeSpan.FromSeconds(0.05);

        public static byte[] RawResourceData;

        public static bool Initialized;
        public static bool CooldownsInitialized;
        public static bool ResourcesInitialized;
        public static bool JobsInitialized;
        public static bool InitializedActor = false;
        private static List<Signature> _sList;
        private static readonly object RefreshLock = new object();

        private static IntPtr _characterAddress = IntPtr.Zero;


                            var address = Scanner.Instance.Locations["CLASSRESOURCES"];

                            //PluginController.debug(" " + address.ToString("X8"));
                            RawResourceData = MemoryHandler.Instance.GetByteArray(address.GetAddress(), 20);
                        }


                        LastUpdated = DateTime.Now;
                    }
                }
                catch
                {
                    Initialized = false;
                }
            }
        }

        public static void CheckCache()
        {
            lock (CacheLock)
            {
                if (LastUpdated + UpdateInterval <= DateTime.Now)
                    RefreshData();
                /*
                if (initializedActor)
                {
                    GetRecentAction();
                }
                */
            }
        }

        public static float GetTimer(int i)
        {
            if (!Initialized)
                return 0;

            CheckCache();

            return Math.Max(BitConverter.ToUInt16(RawResourceData, i) / 1000f, 0);
        }

        public static byte GetRaw(int i)
        {
            if (!Initialized)
                return 0;

            CheckCache();

            return RawResourceData[i];
        }

        public static void StartGcdPredict()
        {
            _predictGcdUntil = DateTime.Now + TimeSpan.FromSeconds(0.5);
            _predictGcdDone = DateTime.Now + TimeSpan.FromSeconds(2.5);
        }

        public static void StartCastPredict()
        {
            _predictCastUntil = DateTime.Now + TimeSpan.FromSeconds(0.5);
            _predictCastDone = DateTime.Now + TimeSpan.FromSeconds(2.5);
        }

        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        private struct ClassResourceRawData
        {
            [MarshalAs(UnmanagedType.I2)]
            [FieldOffset(6)] // B0
            public short resource1;
            
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(8)] // B2
            public byte resource2;
            
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(9)] // B3
            public byte resource3;
            
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(10)] // B4
            public byte resource4;
            
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(11)] // B5
            public byte resource5;
            
            [MarshalAs(UnmanagedType.I1)]
            [FieldOffset(12)] // B6
            public byte resource6;
            
            [MarshalAs(UnmanagedType.I2)]
            [FieldOffset(13)] // B7
            public short resource7;
        }
        
        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        private struct CooldownRawData
        {
            // 01CECC84
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x0)] // 
            public float afterSkillLockTime;

            [MarshalAs(UnmanagedType.Bool)]
            [FieldOffset(0x20)]
            public bool currentlyCasting;

            // 01CECCB0
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x28)] // 
            public float castTimeElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2C)] // 
            public float castTimeTotal;



            // 01CECCE0
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x58)] // 
            public float comboTimeRemaining;



            // 01DF98A4
            // 01DF99A0
            [MarshalAs(UnmanagedType.U4)]
            [FieldOffset(0x118)] // 
            public int actionCount;


            // 
            //  (98)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x184)]
            public float cooldownType98Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x188)]
            public float cooldownType98Total;


            // 
            //  (99)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x198)]
            public float cooldownType99Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x19C)]
            public float cooldownType99Total;



            // 
            // (0)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1AC)] 
            public float cooldownType0Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1B0)]
            public float cooldownType0Total;


            // 
            // (1)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1C0)] // 0x128
            public float cooldownType1Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1C4)] // 0x12C
            public float cooldownType1Total;


            // 
            // (2)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1D4)] // 0x150
            public float cooldownType2Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1D8)] // 0x154
            public float cooldownType2Total;


            // 
            // (3)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1E8)] // 0x18C
            public float cooldownType3Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1EC)] // 0x190
            public float cooldownType3Total;



            // 
            // (4)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x1FC)] // 0x204
            public float cooldownType4Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x200)] // 0x208
            public float cooldownType4Total;




            // 
            // (5)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x210)] // 0x114
            public float cooldownType5Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x214)] // 0x118
            public float cooldownType5Total;




            // 
            // (6)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x224)] // 0x13C
            public float cooldownType6Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x228)] // 0x140
            public float cooldownType6Total;


            // 
            // (7)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x238)] // 0x178
            public float cooldownType7Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x23C)] // 0x17C
            public float cooldownType7Total;


            // 
            // (8)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x24C)] // 0x1B4
            public float cooldownType8Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x250)] // 0x1B8
            public float cooldownType8Total;



            // 
            // (9)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x260)] // 0x1DC
            public float cooldownType9Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x264)] // 0x1E0
            public float cooldownType9Total;




            // 
            // (10)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x274)] // 0x164
            public float cooldownType10Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x278)] // 0x168
            public float cooldownType10Total;


            // 
            // (11)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x288)] // 0x1A0
            public float cooldownType11Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x28C)] // 0x1A4
            public float cooldownType11Total;



            // 02138AC8
            // (12)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x29C)] // 0x1C8
            public float cooldownType12Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2A0)] // 0x1CC
            public float cooldownType12Total;




            // 
            // (13)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2B0)] // 0x1F0
            public float cooldownType13Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2B4)] // 0x1F4
            public float cooldownType13Total;


            // 02138AF0
            // (14)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2C4)] // 0x1F0
            public float cooldownType14Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2C8)] // 0x1F4
            public float cooldownType14Total;



            // 02138AF0
            // (15)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2D8)] // 0x1F0
            public float cooldownType15Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2DC)] // 0x1F4
            public float cooldownType15Total;


            // 02138AF0
            //  (16)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2EC)] // 0x1F0
            public float cooldownType16Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x2F0)] // 0x1F4
            public float cooldownType16Total;


            // 02138AF0
            //  (17)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x300)] // 0x1F0
            public float cooldownType17Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x304)] // 0x1F4
            public float cooldownType17Total;


            // 02138AF0
            //  (18)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x314)] // 0x1F0
            public float cooldownType18Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x318)] // 0x1F4
            public float cooldownType18Total;


            //  (19)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x328)] // 0x1F0
            public float cooldownType19Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x32C)] // 0x1F4
            public float cooldownType19Total;


            //  (20)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x33C)] // 0x1F0
            public float cooldownType20Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x340)] // 0x1F4
            public float cooldownType20Total;


            //  (21)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x350)] // 0x1F0
            public float cooldownType21Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x354)] // 0x1F4
            public float cooldownType21Total;

            //  (22)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x364)] // 0x1F0
            public float cooldownType22Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x368)] // 0x1F4
            public float cooldownType22Total;

            //  (23)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x378)] // 0x1F0
            public float cooldownType23Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x37C)] // 0x1F4
            public float cooldownType23Total;

            //  (24)
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x38C)] // 0x1F0
            public float cooldownType24Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x390)] // 0x1F4
            public float cooldownType24Total;


            // 022FA638
            // 10FA638
            // 01CED0DC
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4CC)] // 0x434
            public float cooldownCrossClassSlot1Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4D0)] // 0x438
            public float cooldownCrossClassSlot1Total;


            // 01CED0F0
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4E0)] // 0x448
            public float cooldownCrossClassSlot2Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4E4)] // 0x44C
            public float cooldownCrossClassSlot2Total;




            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4F4)] // 02140B30
            public float cooldownCrossClassSlot3Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x4F8)] // 02140B34
            public float cooldownCrossClassSlot3Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x508)] // 02140B44
            public float cooldownCrossClassSlot4Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x50C)] // 02140B48
            public float cooldownCrossClassSlot4Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x51C)] // 02140B58
            public float cooldownCrossClassSlot5Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x520)] // 02140B5C
            public float cooldownCrossClassSlot5Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x530)] // 
            public float cooldownCrossClassSlot6Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x534)] // 
            public float cooldownCrossClassSlot6Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x544)] // 
            public float cooldownCrossClassSlot7Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x548)] // 
            public float cooldownCrossClassSlot7Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x558)] // 
            public float cooldownCrossClassSlot8Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x55C)] // 
            public float cooldownCrossClassSlot8Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x56C)] // 
            public float cooldownCrossClassSlot9Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x570)] // 
            public float cooldownCrossClassSlot9Total;



            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x580)] // 
            public float cooldownCrossClassSlot10Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x584)] // 
            public float cooldownCrossClassSlot10Total;



            // 01CED208
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x5F8)] // 0x560
            public float cooldownSprintElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x5FC)] // 0x564
            public float cooldownSprintTotal;



            // 01CED230
            [MarshalAs(UnmanagedType.Bool)]
            [FieldOffset(0x618)] // 0x588
            public bool globalCooldownInUse;



            // 01CED230
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x620)] // 0x588
            public float globalCooldownElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x624)] // 0x58C
            public float globalCooldownTotal;



            // 01CED244
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x634)] // 02140C70
            public float cooldownPotionElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x638)] // 02140C74
            public float cooldownPotionTotal;



            // 01CED244
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x648)] // 02140C70
            public float cooldownPoisonPotionElapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x64C)] // 02140C74
            public float cooldownPoisonPotionTotal;




            // 01CED3AC
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x79C)] // 0x704
            public float cooldownPetAbility1Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x7A0)] // 0x708
            public float cooldownPetAbility1Total;


            // 01CED3C0
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x7B0)] // 0x718
            public float cooldownPetAbility2Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x7B4)] // 0x71C
            public float cooldownPetAbility2Total;


            // 01CED3D4
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x7C4)] // 0x72C
            public float cooldownPetAbility3Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x7C8)] // 0x730
            public float cooldownPetAbility3Total;


            // 01CED3E8
            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x7D8)] // 0x740
            public float cooldownPetAbility4Elapsed;

            [MarshalAs(UnmanagedType.R4)]
            [FieldOffset(0x7DC)] // 0x744
            public float cooldownPetAbility4Total;



        }

        public class Cooldown
        {
            private DateTime _started = DateTime.MinValue;
            private TimeSpan _totalTime = TimeSpan.Zero;

            public Cooldown(float totalTime)
            {
                _totalTime = TimeSpan.FromSeconds(totalTime);
            }

            public float TimeElapsed => (float) (DateTime.Now - _started).TotalSeconds + CurrentTimeshift;

            public float TimeTotal
            {
                get => (float) _totalTime.TotalSeconds;
                set => _totalTime = TimeSpan.FromSeconds(value);
            }

            public float TimeRemaining => (float) Math.Max(
                (_started + _totalTime - DateTime.Now).TotalSeconds - CurrentTimeshift, 0);

            public void Start(bool irrelivent = false)
            {
                _started = DateTime.Now;
            }
        }
    }
}